print("КВЕСТ")
print("Ты проснулся рано утром в 6 утра. Ты так не выспался, но надо пойти в школу. Будильнок у тебя на 7 утра. Что будешь делать?")
a = int(input("Выбери 1) Поспать до будильника. или 2) Умыться и начать готовиться к школе - "))
if a == 1:
    print("Ты поспал до будильника, и вспомнил что ты не сделал д/з. Что будешь делать?")
    a = int(input("1)Прогулять школу. 2)Пойти в школу. - "))
    if a == 1:
        print("Ты собрался, и пошел. Куда ты пойдешь?")
        a = int(input("1) Пойти в другой район. 2) пойти в парк. - "))
        if a == 1:
            print("Ты пошел в другой район и заблудился. Ты хотел позвонить, но телефон разряжен. Ты не знаешь что делать...")
        else:
            print("Ты пошел в парк. В итоге ты увидел как гуляют твои родители, ведь у них выходной. Дома тебе влетело...")
    else:
        print("Ты пошел в школу. Этот день был не самый лучший. Уроки закончились. Что будешь делать?")
        a = int(input("1) Вырвешь лист из дневника и пойдешь домой. 2) Ты не будешь вырывать лист и пойдешь домой. - "))
        if a == 1:
            print("Ты пришел домой и твои родители не увидели твоей двойки. Хоть что-то хорошее за этот день.")
        else:
            print("Ты пришел домой и родители попросили показать твой дневник. Ты показал, и у тебя было 2 двойки. Этот день стал вдвойне плохим.")
else:
    print("Ты вспомнил что не сделал д/з. Как раз рано проснулся, можешь сделать.")
    a = int(input("1) Выучить огромный стих по литературе. 2)Сделать другие уроки."))
    if a == 1:
        print("Ты выучил стих по литературе и надеялся на лучшее. Что будешь делать?")
        a = int(input("Ты пришел в школу. Литературу отменили, и тебе поставили двойки."))
        if == 1